tap "homebrew/cask"
tap "homebrew/cask-fonts"

cask "caffeine"                 # Prevent Mac Sleep
cask "clocker"                  # Timezones displayed in menu bar
cask "cyberduck"                # FTP                
cask "grandperspective"         # Disk Usage Visualization
cask "hammerspoon"              # Lua Automation
cask "itsycal"                  # Tiny Menu Bar Calendar
cask "keka"                     # Archival Tool
cask "kitty"                    # Performant Terminal Emulator
cask "microsoft-edge"           # This still feels weird...
cask "monitorcontrol"           # Allows better control of ext. monitor settings
cask "mos"                      # Extended Mouse Preferences
cask "mqtt-explorer"            # MQTT Client
cask "nextcloud"                # Self-hosted File/Calendar/Contact Sync
cask "notion"                   # Journaling and Object DB
cask "obsidian"                 # Self-hosted Document Management
cask "orbstack"                 # Container Management
cask "rectangle"                # Shortcut Focused Window Management
cask "signal"                   # Secure Messenger
cask "sol"                      # Spotlight Alternative
cask "soundsource"              # Full system sound control
cask "visual-studio-code"       # Extendable IDE
cask "vlc"                      # Open Source Video Player

brew "bat"          # Syntax highlighting for `cat`
brew "coreutils"    # GNU versions of core *nix utilities
brew "eza"          # Modern ls replacement written in Rust
brew "gh"           # Github CLI
brew "lazygit"      # Alternative Git interface
brew "mas"          # Mac App Store CLI
brew "neovim"       # Modern vim fork
brew "nvm"          # Node.js version management
brew "p7zip"        # 7zip Decompression
brew "tldr"         # Simplified man pages

brew "kubectl"      # Kubernetes CLI
brew "kubecolor"    # Colorized kubectl output

# Fonts
cask "font-fantasque-sans-mono-nerd-font"
